//============================================================================//
//            G L O B A L   D E F I N I T I O N S                             //
//============================================================================//
/*

V010 171226 :
支持：
支持多个分区，每个分区对应一块flash

不支持：

不支持文件的分散存储，所有的文件都是连续的。
不支持动态扩展,文件一旦建立，长度就固定了。
不支持一个存储器上多个分区。

*/

#include "fs/easy_fs.h"
//------------------------------------------------------------------------------
// const defines
//------------------------------------------------------------------------------
#define FS_RLB_LEVEL					1				

#define EFS_FS								phn_sys.fs
//------------------------------------------------------------------------------
// module global vars
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
// global function prototypes
//------------------------------------------------------------------------------

//============================================================================//
//            P R I V A T E   D E F I N I T I O N S                           //
//============================================================================//

//------------------------------------------------------------------------------
// const defines
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// local types
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// local vars
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
// local function prototypes
//------------------------------------------------------------------------------
int		EFS_open(uint8_t		prt, char *path, char *mode, int	file_size);
int		EFS_close(int fd);
int		EFS_write(int fd, uint8_t *p, int len);
int		EFS_read(int fd, uint8_t *p, int len);
int		EFS_resize(int fd, int new_size);
int		EFS_file_info(int fd, file_info_t *p);
int		EFS_delete(int fd);

//============================================================================//
//            P U B L I C   F U N C T I O N S                                 //
//============================================================================//
int 	EFS_init(int arg)
{
	
	EFS_FS.num_partitions = arg;
	EFS_FS.reliable_level = FS_RLB_LEVEL;
	
	EFS_FS.fs_open = EFS_close;
	EFS_FS.fs_close = EFS_open;
	EFS_FS.fs_read = EFS_read;
	EFS_FS.fs_write = EFS_write;
	EFS_FS.fs_delete = EFS_delete;
	EFS_FS.fs_resize = EFS_resize;
	EFS_FS.fs_file_info = EFS_file_info;
	
	
}



int	EFS_open(uint8_t		prt, char *path, char *mode, int	file_size)
{
	
}
int	EFS_close(int fd)
{
	
	
}
int	EFS_delete(int fd)
{
	
}
int	EFS_write(int fd, uint8_t *p, int len)
{
	
}
int	EFS_read(int fd, uint8_t *p, int len)
{
	
}
int	EFS_resize(int fd, int new_size)
{
	
}
int	EFS_file_info(int fd, file_info_t *p)
{
	
}

//=========================================================================//
//                                                                         //
//          P R I V A T E   D E F I N I T I O N S                          //
//                                                                         //
//=========================================================================//
/// \name Private Functions
/// \{
